<template>
  <div class="login-container">

      <div class="title-container">
        <h3 class="title">区块链开放服务平台开发者服务协议</h3>
      </div>

      <div class="container" style="color:#333;">
        欢迎访问飞洛区块链开放服务平台网站（网址：filoop.com）并使用杭州市趣链科技有限公司（以下简称“趣链科技”）提供的产品和服务。在完成官网注册程序前，请您务必仔细阅读并理解《飞洛区块链开放服务平台开发者服务协议》（以下简称“服务协议”）的内容和条款，尤其是可能限制您所享有的权利或增加您应履行的相关义务的内容和条款，在确认充分理解全部内容和条款后选择接受或不接受本服务协议；一旦您完成点击“同意条款并注册”或开始以任何其他方式使用飞洛区块链开放服务平台（以下简称“开放服务平台”）服务，即表明您已阅读并同意本服务协议及趣链科技不时发布的所有内容和条款。
        关于本服务协议，提示您特别关注限制、免责条款，趣链科技对您违规、违约行为的认定处理条款，以及管辖法院的选择条款等。在接受本服务协议之前，请您仔细阅读本服务协议的全部内容。如果您对本服务协议的条款有疑问的，请通过开放服务平台官网客服进行咨询，我们将向您解释条款内容。如果您不同意本服务协议的任意内容，或者无法准确理解开放服务平台对条款的解释，在您已清楚和理解本服务协议的所有内容和条款前，请勿进行后续操作。
        1.术语及含义

        如无特别说明，下列术语在本服务协议中的含义为：

        1.1 开放服务平台或平台：指开放服务平台，是由趣链科技所拥有、控制、经营的 filoop.com 网站及平台网站的下属子页面。

        1.2 开发者或您：指经有效注册、申请后，以其自身名义开发、创作或获得合法授权运营各种应用，并将其接入开放服务平台向用户提供各种服务的，且独立承担法律责任的自然人、法人或其他组织。

        1.3 应用：指由开发者以其自身名义开发、创作，且通过在开放服务平台登记后使用开放服务平台服务的应用程序及相关服务。该应用及其所产生的任何功能、数据、资料仅可在限定范围内读取、使用，不得用于任何与法律法规相违背的用途，不得从事任何非法业务。

        1.4 服务：指开放服务平台向您提供 filoop.com 网站上所展示的服务、相关技术及网络支持服务，开放服务平台仅在本服务协议约定的范围内提供服务。

        1.5 用户：指开放服务平台上开发者提供的应用、信息系统或互联网服务的使用者。

        1.6 用户数据：是指用户在使用开放服务平台、应用等的过程中产生的与用户相关的数据，包括但不限于用户提交的语音数据、图像数据、用户操作行为形成的数据等。

        1.7 开放服务平台运营数据：指用户、开发者在使用开放服务平台服务中产生的相关数据，包括但不限于用户或开发者提交的数据、操作行为形成的数据及各类交易数据等。

        1.8 信息系统：指包括但不限于应用信息、合约代码等所有开发程序及数据信息。

        2.趣链科技、开发者均同意和理解

        2.1 开放服务平台是一个中立的平台服务提供者，本服务协议项下趣链科技仅向开发者提供开发服务开放接口或相关中立的技术支持服务，并且趣链科技有权基于Hyperchain以及平台有序运营、健康发展等因素选择使用本服务的开发者。

        2.2 开发者以其自身名义开发、创作或合法运营其应用，并独立承担全部责任。趣链科技不会、也不可能参与开发者应用的研发、运营等任何活动，趣链科技也不会对开发者的应用进行任何的修改、编辑或整理等。

        2.3 开发者应根据用户所在地法律法规、监管政策对应用的功能进行限制（包括但不限于，禁止代币发行融资、证券发行、非法集资、金融诈骗、传销等）。因开发者应用及服务产生的任何纠纷、责任等，以及开发者违反相关法律法规（包括但不限于用户所在地法律法规、监管政策）或本服务协议约定所引发的任何后果，均与趣链科技无关，由开发者独立承担全部责任，并赔偿一切损失。如侵害到趣链科技或他人权益的，开发者须自行承担全部责任，并赔偿一切损失。

        2.4 用户数据和开放服务平台运营数据的所有权及其他相关权利均属于趣链科技，且是趣链科技的商业秘密，但依法属于用户享有的相关权利除外。未经趣链科技事先书面同意，不得为本服务协议约定之外的目的使用前述数据，亦不得以任何形式将前述数据提供给他人。

        2.5 您应对登录账号的创建、授权、删除等事项尽管理职责。您应妥善保管私钥、平台登录账号等敏感信息，当发生信息泄露或密码遗失时，被盗账号在本平台中进行的一切操作均视为您的行为，由您承担所有责任。

        3.开发者的权利和义务

        3.1 账号注册

        3.1.1 您应当通过登录开放服务平台网站或通过开放服务平台其他指定途径，使用电子邮箱或手机号注册开发者账号（以下简称“账号”）成为开发者。注册账号所使用的电子邮箱或手机号必须是您合法拥有的。账号一经注册成功，该账号不得以任何方式（包括但不限于转让、赠与）允许任何第三方成为您账号的所有者。已经通过手机号码成功注册账号的，应当及时绑定邮箱。

        3.1.2 为保障本服务的合法性及安全性，您不得违反本服务协议的约定将您的账号用于其他目的，包括但不限于使用您的账号为第三方应用申请本服务等。否则，趣链科技有权随时单方限制、中止或终止向您及/或您所登记的应用提供本服务，且未经趣链科技书面同意，您及/或您所登记的应用不得继续或再次使用本服务。

        3.1.3 您注册账号使用的电子邮箱或手机号码、密码，是您登录及使用本服务的凭证。您应当做好电子邮箱账号或手机号码、密码以及进入和管理本服务中的各类产品与服务的口令、密码等敏感信息的保密措施。因您的保密措施不当或您的其他行为，致使上述口令、密码等丢失或泄漏，进而引起的一切损失和后果，均由您自行承担，趣链科技对此不承担任何责任。

        3.1.4 您保证：您注册本服务账号的电子邮箱或手机号码均是您合法拥有的。前述全部电子邮箱、手机号码在本服务中进行的包括但不限于：注册本服务账号、提交相应资质材料、确认和同意相关协议和规则、选择具体服务类别以及进行结算等的操作，均是您自行或您授权他人进行的行为，对您均有约束力。同时，您承担以前述全部电子邮箱或手机号码为标识所进行的全部行为的法律责任。

        3.1.5 若您发现有他人冒用或盗用您的账号及密码、或任何其他未经您合法授权的情形时，应立即以有效方式通知趣链科技（包括但不限于提供您的身份信息和相关身份资料、相关事实情况及您的要求等）。趣链科技收到您的有效请求并核实身份后，会根据不同情况采取相应措施。若您提供的信息不完全、不及时，导致趣链科技无法核实您的身份或趣链科技无法判断您的需求等，进而导致趣链科技无法进行及时处理，给您带来的损失，您应自行承担。同时，趣链科技对您的请求采取措施需要合理期限，在您通知趣链科技之后至趣链科技根据您的有效通知采取措施之前，由于他人行为给您造成的损失，趣链科技不承担任何责任。

        3.1.6 您理解并同意，为保护您及用户的数据安全，防止用户信息泄露、毁损、篡改或者丢失，趣链科技有权对您接入的信息系统实行接入审查，包括但不限于技术水平审查、安全水平审查、主体资质审查等，并根据审查结果向您提出防入侵、防病毒等措施建议。若您的信息系统仍无法符合保护用户数据安全的要求，趣链科技有权拒绝或终止提供本服务。

        3.2 资质材料

        3.2.1 您保证：您如实填写和提交账号注册资料与开发者认证资料，并对资料的真实性、合法性、准确性和有效性承担责任；您具备使用本服务、接入和运营应用或提供相关服务等行为的相关合法资质或经过了相关政府部门的审核批准；您提供的主体资质材料、其他相关资质或证明以及其他任何文件等信息应真实、准确、完整，若相关信息发生变更，您应在变更后【3】个工作日内于开放服务平台进行更新；您具备履行本服务协议项下之义务、各种行为的能力；您履行相关义务、从事相关行为不违反任何对您有约束力的法律文件。否则，趣链科技有权延迟、拒绝或终止提供本服务，并依照本服务协议对违规账号进行处罚，且未经趣链科技书面同意，您及/或您所登记的应用不得继续或再次使用本服务，且应独自承担由此带来的一切责任，并赔偿因此对第三方、趣链科技造成的全部损失。

        3.2.2 您保证：您会依照法律法规和趣链科技的要求提交使用本服务所必需的，真实、准确的，经过您签章确认的主体资质材料以及联系人姓名（名称）、地址、电子邮箱等相关资料。

        3.2.3 您保证：您依法已经具有或获得了在开放服务平台上通过您的应用提供各种服务的相关的合法资质或有关部门的许可或批准，并且您应向趣链科技提交相关资质或证明文件。若由于您自身原因未能获得提供相关服务的合法资质或有关部门的许可或批准，由此对您、趣链科技或任何第三方造成的一切直接或间接的损失均由您承担责任，并予以赔偿。

        3.2.4 您保证：您在开放服务平台上通过您的应用提供的各种服务，符合国家相关法律法规的规定，及相关协议、规则的约定，也不会侵犯任何人的合法权益。同时，您应依法、依约或按照趣链科技的要求提供版权、专利权等相关证明文件。

        3.3 服务费用

        3.3.1 开放服务平台部分服务目前以免费方式提供（如开放服务平台开发者资质认证服务等），若该等免费服务变更为以收费方式提供，您继续或开始使用收费服务的，需遵守趣链科技相关的专项规则。

        3.3.2 趣链科技可能根据实际需要对收费服务的收费标准、收费方式进行修改和变更，趣链科技也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，趣链科技将在相应服务页面进行通知或公告。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。

        3.3.3 开放服务平台部分服务目前以免费方式提供（如开放服务平台快速部署试用版联盟链、公共链Filocean、Flioceantest的使用等），该免费服务不可用于生产环境中，在您使用该服务时，存储的数据安全、数据完整性问题、服务提供稳定性、服务时效性等问题，需由您自行负责。

        3.4 开发者资质认证

        3.4.1 您可以为您的开发者账号申请开放服务平台开发者资质认证（以下简称“开发者认证”）。开发者认证服务内容仅限于开发者资质审核，趣链科技仅对您提交的资料和信息进行审核，并不对您实际运营行为承担任何责任或提供任何担保。因您的行为导致与其他开发者或第三方发生争议的，由您独立对外承担责任，因此给趣链科技、其他开发者或第三方造成损害的，您应当依法予以赔偿。

        3.4.2 为向用户提供更专业的服务，您同意并授权趣链科技可以委托第三方对您所提交的认证资料进行审核，并根据审核情况进行独立判断后确定认证结果。同时，为依法保护相关权利人的在线权利并规范平台运营，部分开放服务平台开发者账号需要认证才能注册和使用。关于开发者认证的具体规则，请遵守趣链科技为此发布的专项规则。

        3.5 应用要求

        3.5.1 您应自行负责您应用的创作、开发、编辑、加工、修改、测试、运营及维护等工作，并且自行承担相应的费用及责任。

        3.5.2 您的应用，应符合相关法规、技术规范或标准等，同时，还应符合开放服务平台对接入应用在技术、安全等方面的统一要求，以确保应用可以在开放服务平台安全、稳定的运营。因您的应用违反本条约定而对趣链科技或任何第三方造成损失的，您应赔偿由此产生的一切直接、间接损失。

        3.5.3 您的应用对本服务相关的API的使用，不得进行任何形式的更改。您应在应用中的显著位置正确、完整地标注“Powered by飞洛区块链开放服务平台”或“技术由飞洛区块链开放服务平台提供”的字样。否则，趣链科技有权随时中止或终止向您提供本服务。

        3.5.4 在您的应用于开放服务平台上运营的期间，您需向用户提供及时有效的客户服务，客户服务形式包括但不限于通过明确且合理的方式告知用户客户服务渠道、提供邮箱/电话等，并自行承担客服费用。

        3.5.5 您应当在应用中向相关权利人提供投诉途径、提供邮箱/电话等，确保权利人在认为您侵犯其合法权益时可以向您主张权利。

        3.5.6 为保障用户能对应用进行正确的识别、辨别和区分，保障用户的知情权、选择权以及第三方的合法权益，您的应用名称应当与您的应用存在关联性，不得以任何形式侵犯他人合法权益，违反法律法规的规定或社会道德、公序良俗，且每一个应用只能使用一个应用名称。您应当向趣链科技提交真实、准确、完整的应用或网站信息，包括但不限于域名、链接、在其他第三方处分配的账号、字段等。趣链科技有权对上述信息进行提取、分析、评估、比对，作为对相关应用、网站进行真实性、合法性、安全性等审核的校验、判断依据。趣链科技的检验及判断不视为趣链科技对您的应用进行任何明示或暗示的保证，不对您及您的应用的任何行为承担任何责任。

        3.6 应用运营

        3.6.1 您应自行按照相关法律法规，运营您的应用，履行相关义务，并自行承担全部责任，包括但不限于：

        （1）依照相关法律法规的规定，保留相应的访问、使用等日志记录；

        （2）国家有权机关向您依法查询相关信息时，应积极配合提供；

        （3）主动履行其他您依法应履行的义务。

        3.6.2 您保证：

        （1）您的应用、提供给用户的相关服务及发布的相关信息、内容等，不违反相关法律、法规、政策等的规定及本服务协议或相关协议、规则等的约定，也不会侵犯任何人的合法权益；

        （2）您自行对您应用中由用户使用应用服务产生的内容（包括但不限于留言、消息、评论、名称等）负责，保证其不违反相关法律、法规、政策的规定以及公序良俗等。否则，您应及时采取删除、断开连接或其他有效措施；

        （3）应用设计上应当重视用户体验，尊重用户知情权、选择权。应用服务应当坚持诚信原则，不误导、欺诈、混淆用户，尊重用户的隐私，不骚扰用户，不制造垃圾信息。

        3.6.3 您不得从事任何包括但不限于以下的违反法律法规的行为，也不得为以下违反法律法规的行为提供便利（包括但不限于为您应用的用户的行为提供便利等）：

        （1）反对宪法所确定的基本原则的行为；

        （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的行为；

        （3）损害国家荣誉和利益的行为；

        （4）煽动民族仇恨、民族歧视，破坏民族团结的行为；

        （5）破坏国家宗教政策，宣扬邪教和封建迷信的行为；

        （6）散布谣言，扰乱社会秩序，破坏社会稳定的行为；

        （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的行为；

        （8）侮辱或者诽谤他人，侵害他人合法权益的行为；

        （9）侵害他人知识产权、商业秘密等合法权利的行为；

        （10）恶意虚构事实、隐瞒真相以误导、欺骗他人的行为；

        （11）发布、传送、传播广告信息及垃圾信息；

        （12）删除、隐匿、改变开放服务平台显示或其中包含的任何专利、著作权、商标或其他所有权声明；

        （13）以任何方式干扰或企图干扰趣链科技任何产品、任何部分或功能的正常运行，或者制作、发布、传播上述工具、方法等；

        （14）除本服务协议另有约定外，未经趣链科技书面许可，您不得在应用中使用包括但不限于“趣链科技”、“飞洛客”、“飞洛印”、“鱼糖”或其他趣链科技商标标识或其任何变体、缩写、改写等；

        （15）避开、尝试避开或声称能够避开任何内容保护机制，或导致用户认为其直接与开放服务平台及趣链科技相关产品进行交互；

        （16）在未获得趣链科技书面许可的情况下，以任何方式使用或为第三方应用申请使用趣链科技URL地址、技术接口等；

        （17）在未经过用户同意的情况下，向任何其他用户及他方显示或以其他任何方式提供该用户的任何信息；

        （18）请求、收集、索取或以其他方式获取用户手机号、邮箱等趣链科技服务的登录账号、密码或其他任何身份验证凭据，包括但不限于用户手机号、邮箱等；

        （19）为任何用户自动登录到开放服务平台提供代理身份验证凭据；

        （20）提供跟踪功能，包括但不限于识别其他用户在个人主页上查看、点击等操作行为；

        （21）自动将浏览器窗口定向到其他网页；

        （22）未经授权获取对趣链科技产品或服务的访问权；

        （23）应用中含有计算机病毒、木马或其他恶意程序等任何可能危害趣链科技或用户权益和终端信息安全等的内容；
      </div>

  </div>
</template>

<script>

export default {
  name: 'Login',
  data() {
    
    return {
      
    }
  },
  watch: {
    $route: {
      handler: function(route) {
        this.redirect = route.query && route.query.redirect
      },
      immediate: true
    }
  },
  methods: {
    
  }
}
</script>

<style lang="scss">
/* 修复input 背景不协调 和光标变色 */
/* Detail see https://github.com/PanJiaChen/vue-element-admin/pull/927 */

$bg:#283443;
$light_gray:#fff;
$cursor: #fff;

@supports (-webkit-mask: none) and (not (cater-color: $cursor)) {
  .login-container .el-input input {
    color: $cursor;
  }
}

</style>

<style lang="scss" scoped>
$bg:#2d3a4b;
$dark_gray:#889aa4;
$light_gray:#eee;

.login-container {
  .title{
    padding:20px 0 0;
    text-align:center;
  }
  background:$bg;
  padding:20px;
  color:#eee;
  font-size:14px;
  line-height:22px;
}
</style>
